livraria-api/app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("nome", "idade", "sexo", "created_at", "updated_at", "endereco_id") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Philipe"], ["idade", "1998-06-11"], ["sexo", "Male"], ["created_at", "2020-06-10 03:28:08.057659"], ["updated_at", "2020-06-10 03:28:08.057659"], ["endereco_id", 3]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    if @cliente.save

UPDATE "clientes" SET "nome" = ?, "idade" = ?, "sexo" = ?, "endereco_id" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["nome", "Philipe"], ["idade", "1998-06-11"], ["sexo", "Male"], ["endereco_id", 10], ["updated_at", "2020-06-10 03:38:54.166145"], ["id", 10]]
---
  def update
    if @cliente.update(cliente_params)

DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 2]]
---
  def destroy
    @cliente.destroy