livraria-api/app/controllers/generos_controller.rb

SELECT "generos".* FROM "generos"
---
  def index
    @generos = Genero.all

INSERT INTO "generos" ("nome", "recomendacao", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Teste"], ["recomendacao", "idosos"], ["created_at", "2020-06-11 22:32:36.644006"], ["updated_at", "2020-06-11 22:32:36.644006"]]
---
  def create
    @genero = Genero.new(genero_params)

    if @genero.save

UPDATE "generos" SET "nome" = ?, "updated_at" = ? WHERE "generos"."id" = ?  [["nome", "Teste2"], ["updated_at", "2020-06-11 22:33:46.950275"], ["id", 11]]
---
  def update
    if @genero.update(genero_params)

DELETE FROM "generos" WHERE "generos"."id" = ?  [["id", 11]]
---
  def destroy
    @genero.destroy

SELECT "generos".* FROM "generos" WHERE "generos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_genero
      @genero = Genero.find(params[:id])