livraria-api/app/controllers/livros_controller.rb

SELECT "livros".* FROM "livros"
---
  def index
    @livros = Livro.all

INSERT INTO "livros" ("exemplar", "disponibilidade", "created_at", "updated_at", "genero_id", "autor_id") VALUES (?, ?, ?, ?, ?, ?)  [["exemplar", "Teste"], ["disponibilidade", "D"], ["created_at", "2020-06-11 22:39:28.362763"], ["updated_at", "2020-06-11 22:39:28.362763"], ["genero_id", 2], ["autor_id", 3]]
---
  def create
    @livro = Livro.new(livro_params)

    if @livro.save

DELETE FROM "livros" WHERE "livros"."id" = ?  [["id", 11]]
---
  def destroy
    @livro.destroy

SELECT "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_livro
      @livro = Livro.find(params[:id])