livraria-api/lib/tasks/dev.rake

  task setup: :environment do
 puts "Cadastrando 10 enderecos fake"
 10.times do |i|
  Endereco.create!(
    rua: Faker::Address.street_name,
    numero: Faker::Address.building_number
  )
end
puts "10 enderecos cadastrados com sucesso"

puts "Cadastrando 10 clientes fake"
  10.times do |i|
  Cliente.create!(
  nome: Faker::Name.name,
  idade: Faker::Date.birthday(min_age: 18, max_age: 65),
  sexo: Faker::Gender.binary_type,
  endereco: Endereco.all.sample
  )
end
  puts "Clientes cadastrados com sucesso"

  puts "Cadastrando 10 autores fake"
  10.times do |i|
  Autor.create!(
    nome: Faker::Book.author,
    aniversario: Faker::Date.birthday(min_age: 18, max_age: 65)
  )
---
INSERT INTO "enderecos" ("rua", "numero", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rua", "Kutch Villages"], ["numero", "535"], ["created_at", "2020-06-09 14:11:28.921172"], ["updated_at", "2020-06-09 14:11:28.921172"]]
INSERT INTO "clientes" ("nome", "idade", "sexo", "created_at", "updated_at", "endereco_id") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Cary Schuppe"], ["idade", "1984-02-02"], ["sexo", "Male"], ["created_at", "2020-06-09 14:11:29.188426"], ["updated_at", "2020-06-09 14:11:29.188426"], ["endereco_id", 17]]
SELECT "enderecos".* FROM "enderecos"
INSERT INTO "autors" ("nome", "aniversario", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Fredrick Bayer"], ["aniversario", "1993-08-04"], ["created_at", "2020-06-09 14:11:29.374273"], ["updated_at", "2020-06-09 14:11:29.374273"]]


  puts "Cadastrando 10 generos fake"
  10.times do |i|
  Genero.create!(
  nome: Faker::Book.genre,
  recomendacao: Faker::Relationship.familial
  )
---
INSERT INTO "generos" ("nome", "recomendacao", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Speech"], ["recomendacao", "Grandmother"], ["created_at", "2020-06-09 14:11:29.556600"], ["updated_at", "2020-06-09 14:11:29.556600"]]


  puts "Cadastrando 10 livros fake"
  10.times do |i|
  Livro.create!(
    exemplar: Faker::Book.title,
    ano: Faker::Date.between(from: 2.days.ago, to: Date.today),
    disponibilidade: Faker::Lorem.word,
    autor: Autor.all.sample,
    genero: Genero.all.sample
  )
---
INSERT INTO "livros" ("exemplar", "ano", "disponibilidade", "created_at", "updated_at", "genero_id", "autor_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "autors".* FROM "autors"
SELECT "generos".* FROM "generos"